/******************** (C) COPYRIGHT 2016 DammStanger *****************************************
**--------------文件信息----------------------------------------------------------
 * 文件名	：ADC_51.c
 * 描	述	：STC 60S2 ADC外设驱动
 *            
 * 实验平台	：自控水泵V2.0
 * 硬件连接	：
 * 版 	本	：V0.1.160128
 * 从属关系	：PoolAuto
 * 库版本	：无
 * 创建时间	：2016.1.28
 * 最后编辑	：2016.1.28
 **-------------------------------------------------------------------------------

 * 作	者	：Damm Stanger
 * 邮	箱	：dammstanger@qq.com
**********************************************************************************************/

/****************************包含头文件*******************************************/
#include "ADC_51.h"
#include "globaldefine.h"
#include <intrins.h>
#include "Sensor.h"
#include "UART_51.h"
/****************************宏定义***********************************************/

/********************************************************************************
 * 函数名：ADC_Init()
 * 描述  ：ADC的初始化
 * 输入  ：-port 端口
 * 返回  ：-
 * 调用  ：-
 ********************************************************************************/
void ADC_Init()
{
	P1ASF = AFPORT_P1_0;		//只写 通道0所在的P1.0口复用
	ADC_RES = 0;
	ADC_RESL= 0;
	ADC_CONTR = ADC_PWR|ADC_SPEED;
	_nop_();					//空操作 #include <intrins.h>
	_nop_();					//4个时钟周期后才可读
	_nop_();
	_nop_();
	AUXR1 |= 0x04;				//R/W寄存器 8低位，2高位模式
	EADC = 1;					//开中断，
								//优先级默认
}  
 

/********************************************************************************
 * 函数名：ADC_STARTCOV()
 * 描述  ：ADC 开始转换
 * 输入  ：-
 * 返回  ：-
 * 调用  ：-
 ********************************************************************************/
void ADC_STARTCOV(char ch,char speed)
{
	ADC_CONTR = ADC_PWR|speed|ADC_SRART|ch;
}


/********************************************************************************
 * 函数名：ADC_ISR()
 * 描述  ：ADC中断服务函数
 * 输入  ：-
 * 返回  ：-
 * 调用  ：-
 ********************************************************************************/
void ADC_ISR() interrupt 5 
{	
	ADC_CONTR &= ~ADC_FLAG;					//清除标志位
	SendString("ADC data:\r\n");		
	PressDatHandle(0x03&ADC_RES,ADC_RESL);
}

/******************* (C) COPYRIGHT 2016 DammStanger *****END OF FILE************/
