/******************** (C) COPYRIGHT 2016 DammStanger *****************************************
**--------------文件信息----------------------------------------------------------
 * 文件名	：SPI_51.c
 * 描	述	：STC 60S2 SPI外设驱动
 *            
 * 实验平台	：自控水泵V2.0
 * 硬件连接	：
 * 版 	本	：V0.1.160121
 * 从属关系	：PoolAuto
 * 库版本	：无
 * 创建时间	：2016.1.21
 * 最后编辑	：2016.1.21
 **-------------------------------------------------------------------------------

 * 作	者	：Damm Stanger
 * 邮	箱	：dammstanger@qq.com
**********************************************************************************************/

/****************************包含头文件*******************************************/
#include "SPI_51.h"
/********************************************************************************
 * 函数名：SPI_Init()
 * 描述  ：SPI的初始化
 * 输入  ：-mode 主模式、从模式
 * 返回  ：-
 * 调用  ：-
 ********************************************************************************/
void SPI_Init(bit mode)
{
	SPDAT = 0;					//初始化数据寄存器
	SPSTAT = SPIF|WCOL;			//标志位清零
	if(mode==MASTER)
	{
		SPCTL = SSIG|SPEN|MSTR|SPI_SPEED_4;		//由内部确定主机模式，MSB，数据传输从高位先发，时钟空闲时为低电平
	}
	else
		SPCTL = SPEN;
}  
 
///********************************************************************************
// * 函数名：SPI_SetSpeed()
// * 描述  ：SPI时钟频率
// * 输入  ：-
// * 返回  ：-
// * 调用  ：-
// ********************************************************************************/
//void SPI_SetSpeed(bit SpeedSet)
//{
//	SPCTL &= ~(SPEN|0x03);
//	if(SpeedSet==SPI_SPEED_4)//四分频 
//		SPCTL |= SPEN|0x00;		
//	else if(SpeedSet==SPI_SPEED_16)		//16分频 
//		SPCTL |= SPEN|0x01;				
//	else if(SpeedSet==SPI_SPEED_64)		//64分频
//		SPCTL |= SPEN|0x02;		
//	else if(SpeedSet==SPI_SPEED_128)	//128分频
//		SPCTL |= SPEN|0x03;		
//	else;	
//	
//} 


/********************************************************************************
 * 函数名：SPI_ReadWriteByte()
 * 描述  ：SPI读写一个字节
 * 输入  ：-TxData:要写入的字节
 * 返回  ：-
 * 调用  ：-
 ********************************************************************************/
char SPI_ReadWriteByte(char dat)
{		
	SPDAT = dat;
	while(!(SPSTAT&SPIF));				//等待发送完成
	SPSTAT = SPIF | WCOL;				//清除标志位
	dat = SPDAT;	
	return dat;							//返回最近接收的数据
}

/********************************************************************************
 * 函数名：SPI_ISR()
 * 描述  ：SPI中断服务函数
 * 输入  ：-
 * 返回  ：-
 * 调用  ：-
 ********************************************************************************/
//char SPI_ISR(char dat) interrupt 9 
//{	
//	
//}

/******************* (C) COPYRIGHT 2016 DammStanger *****END OF FILE************/
