/******************** (C) COPYRIGHT 2015 DammStanger *****************************************
**--------------文件信息----------------------------------------------------------
 * 文件名	：globaldefine.h
 * 描	述	：
 *                    
 * 实验平台	：51开发板
 * 硬件连接	：
 * 版 	本	：V0.0.150711
 * 从属关系	：PoolAuto
 * 库版本	：无
 * 创建时间	：2015.7.11
 * 最后编辑	：2015.7.11
 **-------------------------------------------------------------------------------

 * 作	者	：Damm Stanger
 * 邮	箱	：dammstanger@qq.com
**********************************************************************************************/

#ifndef __GLOBALDEFINE_H_
#define __GLOBALDEFINE_H_

/****************************包含头文件*******************************************/
#include <STC12C5A60S2.H>

/****************************宏定义***********************************************/
#define uchar	unsigned char 
#define uint	unsigned int

/****************************类型定义***********************************************/
typedef enum {FALSE = 0, TRUE = !FALSE} bool;
typedef struct{
	uchar temp_h;
	uchar temp_l;
	uchar press_h;
	uchar press_l;
	uchar flow;
	uchar possw;
}PAG_DATA;
/****************************变量声明*********************************************/

sbit LED1 = P2^6;
sbit LED2 = P5^1;

extern PAG_DATA sensor_data;
#endif
/******************* (C) COPYRIGHT 2015 DammStanger *****END OF FILE************/
